#Task1
# number=int(input("\033[92mВведіть номер тиждня від 1 до 7:"))
# if number==1:
#     print("\033[91mПонеділок")
# elif number==2:
#     print("\033[94mВівторок")
# elif number==3:
#     print("	\033[95mСереда")
# elif number==4:
#     print("	\033[96mЧетвер")
# elif number==5:
#     print("	\033[92mПʼятниця")
# elif number==6:
#     print("	\033[93mСубота")
# elif number==7:
#     print("	\033[91mНеділя")
# else:
#     print("\033[91mВ тиждні всього сім днів,вибери цифру вірно!!!!")
#Task2
# number=int(input("\033[92mВведіть номер місяця від 1 до 12:"))
# if number==1:
#     print("\033[94mСічень")
# elif number==2:
#     print("\033[94mЛютий")
# elif number==3:
#     print("\033[96mБерезень")
# elif number==4:
#     print("\033[96mКвітень")
# elif number==5:
#     print("\033[96mТравень")
# elif number==6:
#     print("\033[92mЧервень")
# elif number==7:
#     print("\033[92mЛипень")
# elif number==8:
#     print("\033[92mСерпень")
# elif number==9:
#     print("\033[93mВересень")
# elif number==10:
#     print("\033[93mЖовтень")
# elif number==11:
#     print("\033[93mЛистопад")
# elif number==12:
#     print("\033[94mГрудень")
# else:
#     print("\033[91mВ році всього 12 місяців,будь-ласка введи вірну цифру!!!!")
#Task3
# age=int(input("\033[101m\033[30mКористувач будь-ласка введи свій вік:"))
# purchases=float(input("\033[102m\033[30mКористувач будь-ласка Введіть суму вашою покупки:"))
# if age<18:
#     res=purchases*(1-10/100)
#     print(f"\033[104m\033[30mВаша кінцева сума з урахуванням знижки згідно вашого віку={res}грн")
# elif 18<age<60:
#     res=purchases*(1-5/100)
#     print(f"\033[104m\033[30mВаша кінцева сума з урахуванням знижки згідно вашого віку={res}грн")
# elif age>60:
#     res=purchases*(1-15/100)
#     print(f"\033[104m\033[30mВаша кінцева сума з урахуванням знижки згідно вашого віку={res}грн")
#Task4
# num1,num2,num3=map(int,input("\033[30m\033[47mВведіть оцінки по трьох предметах від 1 до 5 балів,через пробіл:").split())
# if num1==2 or num2==2 or num3==2:
#     print("\033[30m\033[41mНезадовільно")
# elif num1>=4 and num2>=4 and num3>=4:
#     print("\033[30m\033[42mВідмінно")
# else:
#     print("\033[43m\033[30mБачу в тебе немає двійок але все ж таки є одна або декілька трійок, не переймайся ти всеодно Молодець!!!!")
#Task5
# num1,num2,num3,num4=map(int,input("\033[90m\033[107mВведіть будь-ласка оцінки з чотирьох предметів (від 1 до 5) через пробіл:").split())
# if num1<3 or num2<3 or num3<3 or num4<3:
#     print("\033[90m\033[101mВаші оцінки мають бал нижче 3,вибачте ви не допускаєтесь до іспиту,потрібно працювати кроаще!!!\033[0m")
# elif num1>=4 and num2>=4 and num3>=4 and num4>=4:
#     print("\033[102m\033[90mВітаю ви дуже гарно постарались на навчанні ви допускаєтесь до іспиту з відзнакою!!!\033[0m")
# else:
#     print("\033[102m\033[90mВітаю ви допущені до іспиту!!!\033[0m")
#Task6
# age=float(input("\033[90m\033[107mБудь-ласка введіть вік вашого автомобіля:"))
# mileage=float(input("\033[90m\033[103mБудь-ласка введіть пробіг вашого автомобіля:"))
# if age<3 and mileage<30000:
#     print("\033[102m\033[90mВітаю ваш автомобіль у відмінному стані\033[0m")
# elif age<10 and mileage<100000:
#     print("\033[90m\033[104mВітаю ваш автомобіль у хорошому стані\033[0m")
# else:
#     print("\033[90m\033[101mРаджу вам навідатись у майстерню автомобіль потребує перевірки!!!\033[0m")