#Завдання 1
# x=int(input("Num 1:"))
# y=int(input("Num 2:"))
# z=int(input("Num 3:"))
# print("Result:", x , "+" ,y, "+" ,z, "=" , x+y+z)
# print("Result:", x , "*" ,y, "*" ,z, "=" , x*y*z)
#Завдання 2
# x=int(input("a:"))
# y=int(input("h:"))
# print("S:", x , "*" ,y, "=" , x*y)
#Завдання 3
# x=int(input("Зарплата:"))
# y=int(input("Платіж:"))
# z=int(input("Комунальний борг:"))
# print("Залишок зарплати:", x , "-" ,y, "-" ,z, "=" , x-y-z)
#Завдання 4
# D=int(input("Відстань у км:"))
# R=int(input("Витрати палива в км/год:"))
# P=int(input("Ціна за літр бензину:"))
# #Варіант 1
# print("Вартість поїздки:", D/100 , "*" ,R, "*" ,P, "=" , ((D/100)*R)*P)
# #Варіант 2
# print("Вартість поїздки:", D , "*" ,R, "*" ,P, "=" , ((D/100)*R)*P)
# В залежності який вид відповідь більше приємний і зрозумілий
#Завдання 5
# S=int(input("Загальна сума рахунку:"))
# N=int(input("Кількість осіб:"))
# tip=S*0.15
# total=S+tip
# print("Сума чайових:",S, "*" ,0.15, "=" ,tip , S*0.15)
# print("Загальна сума чайових:",S, "+" ,tip, "=" , S+tip)
# print("Чайові на одну особу:",total, "/" ,N, "=" , total/N)
#Трохи був тут заплутався але надыюсь це вірна відповідь,якщо будуть якісь коментарі буду вдячний.
# Завдання 6
# P=int(input("Вартість оренди за день в грн:"))
# D=int(input("Кількість днів оренди:"))
# Z=int(input("Застава:"))
# Загальна вартість оренди (без застави):
# RentalCost=P*D
# Загальна сума до оплати (з урахуванням застави):
# TotalPayment=RentalCost+Z
# Сума, яку користувач фактично заплатить після повернення авто (заставу повернуто):
# FinalCost=RentalCost
# Вартість оренди за один день (перевірка):
# DailyCost=RentalCost/D
# print("Загальна вартість оренди (без застави):",P, "*" ,D, "=" , P*D)
# print("Загальна сума до оплати (з урахуванням застави):",RentalCost, "+" ,Z, "="  , RentalCost+Z)
# print("Сума, яку користувач фактично заплатить після повернення авто (заставу повернуто):", FinalCost, "=", RentalCost)
# print("Вартість оренди за один день (перевірка):",RentalCost, "/" ,D, "=" , RentalCost/D)
# print("DailyCost =", DailyCost)
